import numpy as np
import math

from toy_net.common import *

#---------------------------------------------------------------------------------------------------

"""
Проверяем, что модуль переимпортировался в IPython notebook.
"""
print('toy_net.optimizers reload')

#---------------------------------------------------------------------------------------------------


class Optimizer(object):
    """
    Optimizer - алгоритм вычисления дельты весов
    """

    def calculate_dw(self, speed, gw):
        """
        Вычисление дельты весов.
        Args:
            speed: скорость обучения.
            gw: dL/dw - градиент функции потерь по параметрам слоя (например, весам).
                Не может быть None (внешний код должен сам это проверять).
        Returns:
            dw: дельта весов - прибавляется к весам слоя.
        """
        raise NotImplementedError()

#---------------------------------------------------------------------------------------------------


class SGD(Optimizer):
    """
    Stochastic Gradient Descent optimizer
    """

    def calculate_dw(self, speed, gw):
        return -speed * gw

#---------------------------------------------------------------------------------------------------
